tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/clkman_regs.h
/*
   Register offsets for module CLKMAN.
*/
/**
 * @ingroup    clkman_registers
 * @defgroup   CLKMAN_Register_Offsets Register Offsets
 * @brief      Clock Management Controller Register Offsets from the CLKMAN Base Peripheral Address. 
 * @{
 */
#define MXC_R_CLKMAN_OFFS_CLK_CONFIG                        ((uint32_t)0x00000000UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0000</tt></b> */
#define MXC_R_CLKMAN_OFFS_CLK_CTRL                          ((uint32_t)0x00000004UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0004</tt></b> */
#define MXC_R_CLKMAN_OFFS_INTFL                             ((uint32_t)0x00000008UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0008</tt></b> */
#define MXC_R_CLKMAN_OFFS_INTEN                             ((uint32_t)0x0000000CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x000C</tt></b> */
#define MXC_R_CLKMAN_OFFS_TRIM_CALC                         ((uint32_t)0x00000010UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0010</tt></b> */
#define MXC_R_CLKMAN_OFFS_I2C_TIMER_CTRL                    ((uint32_t)0x00000014UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0014</tt></b> */
#define MXC_R_CLKMAN_OFFS_CM4_START_CLK_EN0                 ((uint32_t)0x00000018UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0018</tt></b> */
#define MXC_R_CLKMAN_OFFS_CM4_START_CLK_EN1                 ((uint32_t)0x0000001CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x001C</tt></b> */
#define MXC_R_CLKMAN_OFFS_CM4_START_CLK_EN2                 ((uint32_t)0x00000020UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0020</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_0_CM4                ((uint32_t)0x00000040UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0040</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_1_SYNC               ((uint32_t)0x00000044UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0044</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_2_SPIX               ((uint32_t)0x00000048UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0048</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_3_PRNG               ((uint32_t)0x0000004CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x004C</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_4_WDT0               ((uint32_t)0x00000050UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0050</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_5_WDT1               ((uint32_t)0x00000054UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0054</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_6_GPIO               ((uint32_t)0x00000058UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0058</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_7_PT                 ((uint32_t)0x0000005CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x005C</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_8_UART               ((uint32_t)0x00000060UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0060</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_9_I2CM               ((uint32_t)0x00000064UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0064</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_10_I2CS              ((uint32_t)0x00000068UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0068</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_11_SPI0              ((uint32_t)0x0000006CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x006C</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_12_SPI1              ((uint32_t)0x00000070UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0070</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_13_SPI2              ((uint32_t)0x00000074UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0074</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_14_SPIB              ((uint32_t)0x00000078UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0078</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_15_OWM               ((uint32_t)0x0000007CUL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x007C</tt></b> */
#define MXC_R_CLKMAN_OFFS_SYS_CLK_CTRL_16_SPIS              ((uint32_t)0x00000080UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0080</tt></b> */
#define MXC_R_CLKMAN_OFFS_CRYPT_CLK_CTRL_0_AES              ((uint32_t)0x00000100UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0100</tt></b> */
#define MXC_R_CLKMAN_OFFS_CRYPT_CLK_CTRL_1_MAA              ((uint32_t)0x00000104UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0104</tt></b> */
#define MXC_R_CLKMAN_OFFS_CRYPT_CLK_CTRL_2_PRNG             ((uint32_t)0x00000108UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0108</tt></b> */
#define MXC_R_CLKMAN_OFFS_CLK_GATE_CTRL0                    ((uint32_t)0x00000140UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0140</tt></b> */
#define MXC_R_CLKMAN_OFFS_CLK_GATE_CTRL1                    ((uint32_t)0x00000144UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0144</tt></b> */
#define MXC_R_CLKMAN_OFFS_CLK_GATE_CTRL2                    ((uint32_t)0x00000148UL)   /**< Offset from the CLKMAN Base Peripheral Address:<b><tt>0x0148</tt></b> */
/**@} end of CLKMAN_Register_Offsets */
/**
 * @ingroup     clkman_registers
 * @defgroup    clkman_clk_config CLKMAN_CLK_CONFIG Register
 * @brief       Field Positions and Masks 
 */
#define MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_ENABLE_POS           0                                                                                   /**< CRYPTO_ENABLE Position              */
#define MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_ENABLE               ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_ENABLE_POS))             /**< CRYPTO_ENABLE Mask                  */
#define MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_STABILITY_COUNT_POS  4                                                                                   /**< CRYPTO_STABILITY_COUNT Position     */
#define MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_STABILITY_COUNT      ((uint32_t)(0x0000000FUL << MXC_F_CLKMAN_CLK_CONFIG_CRYPTO_STABILITY_COUNT_POS))    /**< CRYPTO_STABILITY_COUNT Mask         */
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup   clkman_clk_ctrl CLKMAN_CLK_CTRL Register
 * @brief      Field Positions and Masks 
 */
#define MXC_F_CLKMAN_CLK_CTRL_SYSTEM_SOURCE_SELECT_POS      0                                                                                   /**< SYSTEM_SOURCE_SELECT Position         */
#define MXC_F_CLKMAN_CLK_CTRL_SYSTEM_SOURCE_SELECT          ((uint32_t)(0x00000003UL << MXC_F_CLKMAN_CLK_CTRL_SYSTEM_SOURCE_SELECT_POS))        /**< SYSTEM_SOURCE_SELECT Mask             */
#define MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_ENABLE_POS          4                                                                                   /**< USB_CLOCK_ENABLE Position             */
#define MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_ENABLE              ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_ENABLE_POS))            /**< USB_CLOCK_ENABLE Mask                 */
#define MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_SELECT_POS          5                                                                                   /**< USB_CLOCK_SELECT Position             */
#define MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_SELECT              ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_USB_CLOCK_SELECT_POS))            /**< USB_CLOCK_SELECT Mask                 */
#define MXC_F_CLKMAN_CLK_CTRL_CRYPTO_CLOCK_ENABLE_POS       8                                                                                   /**< CRYPTO_CLOCK_ENABLE Position          */
#define MXC_F_CLKMAN_CLK_CTRL_CRYPTO_CLOCK_ENABLE           ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_CRYPTO_CLOCK_ENABLE_POS))         /**< CRYPTO_CLOCK_ENABLE Mask              */
#define MXC_F_CLKMAN_CLK_CTRL_RTOS_MODE_POS                 12                                                                                  /**< RTOS_MODE Field Position              */
#define MXC_F_CLKMAN_CLK_CTRL_RTOS_MODE                     ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_RTOS_MODE_POS))                   /**< RTOS_MODE Field Mask                  */
#define MXC_F_CLKMAN_CLK_CTRL_CPU_DYNAMIC_CLOCK_POS         13                                                                                  /**< CPU_DYNAMIC_CLOCK Field Position      */
#define MXC_F_CLKMAN_CLK_CTRL_CPU_DYNAMIC_CLOCK             ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_CPU_DYNAMIC_CLOCK_POS))           /**< CPU_DYNAMIC_CLOCK Field Mask          */
#define MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_ENABLE_POS         16                                                                                  /**< WDT0_CLOCK_ENABLE Field Position      */
#define MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_ENABLE             ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_ENABLE_POS))           /**< WDT0_CLOCK_ENABLE Field Mask          */
#define MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_SELECT_POS         17                                                                                  /**< WDT0_CLOCK_SELECT Field Position      */
#define MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_SELECT             ((uint32_t)(0x00000003UL << MXC_F_CLKMAN_CLK_CTRL_WDT0_CLOCK_SELECT_POS))           /**< WDT0_CLOCK_SELECT Field Mask          */
#define MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_ENABLE_POS         20                                                                                  /**< WDT1_CLOCK_ENABLE Field Position      */
#define MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_ENABLE             ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_ENABLE_POS))           /**< WDT1_CLOCK_ENABLE Field Mask          */
#define MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_SELECT_POS         21                                                                                  /**< WDT1_CLOCK_SELECT Field Position      */
#define MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_SELECT             ((uint32_t)(0x00000003UL << MXC_F_CLKMAN_CLK_CTRL_WDT1_CLOCK_SELECT_POS))           /**< WDT1_CLOCK_SELECT Field Mask          */
#define MXC_F_CLKMAN_CLK_CTRL_ADC_CLOCK_ENABLE_POS          24                                                                                  /**< ADC_CLOCK_ENABLE Field Position       */
#define MXC_F_CLKMAN_CLK_CTRL_ADC_CLOCK_ENABLE              ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_CLK_CTRL_ADC_CLOCK_ENABLE_POS))            /**< ADC_CLOCK_ENABLE Field Mask           */
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup   clkman_int_flags CLKMAN_INTFL Register
 * @brief      Interrupt Flag Positions and Masks 
 */
#define MXC_F_CLKMAN_INTFL_CRYPTO_STABLE_POS                0                                                                                   /**< CRYPTO_STABLE Interrupt Flag Position    */
#define MXC_F_CLKMAN_INTFL_CRYPTO_STABLE                    ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_INTFL_CRYPTO_STABLE_POS))                  /**< CRYPTO_STABLE Interrupt Flag Mask        */
#define MXC_F_CLKMAN_INTFL_SYS_RO_STABLE_POS                1                                                                                   /**< SYS_RO_STABLE Interrupt Flag Position    */
#define MXC_F_CLKMAN_INTFL_SYS_RO_STABLE                    ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_INTFL_SYS_RO_STABLE_POS))                  /**< SYS_RO_STABLE Interrupt Flag Mask        */
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup   clkman_int_enable CLKMAN_INTEN Register
 * @brief      Interrupt Enable Positions and Masks 
 */
#define MXC_F_CLKMAN_INTEN_CRYPTO_STABLE_POS                0                                                                                   /**< CRYPTO_STABLE Field Position         */
#define MXC_F_CLKMAN_INTEN_CRYPTO_STABLE                    ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_INTEN_CRYPTO_STABLE_POS))                  /**< CRYPTO_STABLE Field Mask             */
#define MXC_F_CLKMAN_INTEN_SYS_RO_STABLE_POS                1                                                                                   /**< SYS_RO_STABLE Field Position         */
#define MXC_F_CLKMAN_INTEN_SYS_RO_STABLE                    ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_INTEN_SYS_RO_STABLE_POS))                  /**< SYS_RO_STABLE Field Mask             */
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup   clkman_trim_calc CLKMAN_TRIM_CALC Register
 * @brief      Field Positions and Masks 
 */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CLK_SEL_POS             0                                                                                   /**< TRIM_CLK_SEL Field Position          */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CLK_SEL                 ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_TRIM_CALC_TRIM_CLK_SEL_POS))               /**< TRIM_CLK_SEL Field Mask              */    
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_START_POS          1                                                                                   /**< TRIM_CALC_START Field Position       */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_START              ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_START_POS))            /**< TRIM_CALC_START Field Mask           */        
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_COMPLETED_POS      2                                                                                   /**< TRIM_CALC_COMPLETED Field Position   */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_COMPLETED          ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_COMPLETED_POS))        /**< TRIM_CALC_COMPLETED Field Mask       */            
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_ENABLE_POS              3                                                                                   /**< TRIM_ENABLE Field Position           */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_ENABLE                  ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_TRIM_CALC_TRIM_ENABLE_POS))                /**< TRIM_ENABLE Field Mask               */    
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_RESULTS_POS        16                                                                                  /**< TRIM_CALC_RESULTS Field Position     */
#define MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_RESULTS            ((uint32_t)(0x000003FFUL << MXC_F_CLKMAN_TRIM_CALC_TRIM_CALC_RESULTS_POS))          /**< TRIM_CALC_RESULTS Field Mask         */        
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup    clkman_i2c_1ms CLKMAN_I2C_TIMER_CTRL Register
 * @brief       Field Positions and Masks 
 */
#define MXC_F_CLKMAN_I2C_TIMER_CTRL_I2C_1MS_TIMER_EN_POS    0                                                                                   /**< I2C_1MS_TIMER_EN Position       */
#define MXC_F_CLKMAN_I2C_TIMER_CTRL_I2C_1MS_TIMER_EN        ((uint32_t)(0x00000001UL << MXC_F_CLKMAN_I2C_TIMER_CTRL_I2C_1MS_TIMER_EN_POS))      /**< I2C_1MS_TIMER_EN Mask           */
/**@}*/
/**
 * @ingroup     clkman_registers
 * @defgroup    clkman_cm4 CLKMAN_CM4 Register
 * @brief       Field Positions and Masks 
 */
#define MXC_F_CLKMAN_CM4_START_CLK_EN0_INTS_POS             0                                                                                   /**< CLK_EN0_INTS Position                */
#define MXC_F_CLKMAN_CM4_START_CLK_EN0_INTS                 ((uint32_t)(0xFFFFFFFFUL << MXC_F_CLKMAN_CM4_START_CLK_EN0_INTS_POS))               /**< CLK_EN0_INTS Mask                    */

#define MXC_F_CLKMAN_CM4_START_CLK_EN1_INTS_POS             0                                                                                   /**< CLK_EN1_INTS Position                */
#define MXC_F_CLKMAN_CM4_START_CLK_EN1_INTS                 ((uint32_t)(0xFFFFFFFFUL << MXC_F_CLKMAN_CM4_START_CLK_EN1_INTS_POS))               /**< CLK_EN1_INTS Mask                    */

